ATsupportum/src/Documents/ИспользованиеПоставкиДляАренды_ат/ИспользованиеПоставкиДляАренды_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИспользованиеПоставкиДляАренды_ат</name>
  <registerRecords>AccumulationRegister.АрендаПП_ат</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаПоставокДляАренды</name>
    <attributes>
      <name>Поставка</name>
      <type>
        <types>CatalogRef.ПоставкиПродуктов_ат</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ATsupportum/src/AccumulationRegisters/АрендаПП_ат/АрендаПП_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АрендаПП_ат</name>
  <resources>
    <name>Ресурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПоставкаПродукта</name>
    <type>
      <types>CatalogRef.ПоставкиПродуктов_ат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты_ат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПродуктДляАренды</name>
    <type>
      <types>CatalogRef.ПродуктыДляАренды_ат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры_ат</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ATsupportum/src/Documents/ИспользованиеПоставкиДляАренды_ат/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.АрендаПП_ат.Записывать = Истина;
	Для Каждого ТекСтрокаТаблицаПоставокДляАренды Из ТаблицаПоставокДляАренды Цикл
		Движение = Движения.АрендаПП_ат.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ПоставкаПродукта = ТекСтрокаТаблицаПоставокДляАренды.Поставка;
		Движение.Организация = Организация;
		Движение.Ресурс = ТекСтрокаТаблицаПоставокДляАренды.Поставка.Продукт.Количество;
	КонецЦикла;
	
КонецПроцедуры
